---
kind: method
id: M:Autodesk.Revit.DB.ViewPlan.SetUnderlayOrientation(Autodesk.Revit.DB.UnderlayOrientation)
zh: 平面视图、平面图
source: html/f61874fc-19ce-716d-6d56-e24a288dd271.htm
---
# Autodesk.Revit.DB.ViewPlan.SetUnderlayOrientation Method

**中文**: 平面视图、平面图

Sets the underlay orientation for this view.

## Syntax (C#)
```csharp
public void SetUnderlayOrientation(
	UnderlayOrientation uo
)
```

## Parameters
- **uo** (`Autodesk.Revit.DB.UnderlayOrientation`) - The underlay orientation for this view.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration